## Indexing - Selection - Filtering

In [5]:
import pandas as pd
import numpy as np

In [13]:
obj = pd.Series(np.arange(5),index=['A','B','C','D','E'])

A    0
B    1
C    2
D    3
E    4
dtype: int32

In [14]:
obj[2] #--> FutureWarning

C:\Users\Elmir Quliyev\AppData\Local\Temp\ipykernel_11592\1027971403.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[2]

2

In [15]:
obj['A']

0

In [16]:
obj[0:4]

A    0
B    1
C    2
D    3
dtype: int32

In [17]:
obj[["A","C"]]

A    0
C    2
dtype: int32

In [19]:
obj[obj<2]

A    0
B    1
dtype: int32

In [21]:
#Slicing
obj['A':'B'] #B included

A    0
B    1
dtype: int32

In [27]:
obj['A':'B'] = [11,8]
obj #change values

A    11
B     8
C     2
D     3
E     4
dtype: object

In [53]:
data = pd.DataFrame(np.arange(16).reshape(4,4),index=['Baku','Ganja','Aghdam','Qaradagh'],columns=['A','B','C','D'])
data

           A   B   C   D
Baku       0   1   2   3
Ganja      4   5   6   7
Aghdam     8   9  10  11
Qaradagh  12  13  14  15

In [33]:
data['A']

Baku         0
Ganja        4
Aghdam       8
Qaradagh    12
Name: A, dtype: int32

In [49]:
data[['A','C']]

           A   C
Baku       0   2
Ganja      4   6
Aghdam     8  10
Qaradagh  12  14

In [51]:
data[data['A']>3] = 4
data

          A  B  C  D
Baku      0  1  2  3
Ganja     4  4  4  4
Aghdam    4  4  4  4
Qaradagh  4  4  4  4

In [61]:
#Loc and Iloc use
data.iloc[3]
data.iloc[[1,2],[1,2]]

        B   C
Ganja   5   6
Aghdam  9  10

In [63]:
data.loc['Aghdam',['A','B']]

A    8
B    9
Name: Aghdam, dtype: int32

In [65]:
data.loc[:'Aghdam','D']

Baku       3
Ganja      7
Aghdam    11
Name: D, dtype: int32

In [ ]:
#Have a nice days!!